Update Readme and Documentation
